"""
Напишите игру в кости.
"""

from random import randint
print(randint(1, 6))

