"""
Напишите программу, которая выводит факториал введенного числа.
Код нахождения факториала должен быть написан в одну строку.
"""

from math import factorial
print(factorial(int(input('Введите число: '))))
